{"<s>":0,"</s>":1,"!":2,"\"":3,"#":4,"$":5,"%":6,"&":7,"'":8,"(":9,")":10,"*":11,"+":12,",":13,"-":14,".":15,"/":16,"0":17,"1":18,"2":19,"3":20,"4":21,"5":22,"6":23,"7":24,"8":25,"9":26,":":27,";":28,"<":29,"=":30,">":31,"?":32,"@":33,"A":34,"B":35,"C":36,"D":37,"E":38,"F":39,"G":40,"H":41,"I":42,"J":43,"K":44,"L":45,"M":46,"N":47,"O":48,"P":49,"Q":50,"R":51,"S":52,"T":53,"U":54,"V":55,"W":56,"X":57,"Y":58,"Z":59,"[":60,"\\":61,"]":62,"^":63,"_":64,"`":65,"a":66,"b":67,"c":68,"d":69,"e":70,"f":71,"g":72,"h":73,"i":74,"j":75,"k":76,"l":77,"m":78,"n":79,"o":80,"p":81,"q":82,"r":83,"s":84,"t":85,"u":86,"v":87,"w":88,"x":89,"y":90,"z":91,"{":92,"|":93,"}":94,"~":95,"¡":96,"¢":97,"£":98,"¤":99,"¥":100,"¦":101,"§":102,"¨":103,"©":104,"ª":105,"«":106,"¬":107,"®":108,"¯":109,"°":110,"±":111,"²":112,"³":113,"´":114,"µ":115,"¶":116,"·":117,"¸":118,"¹":119,"º":120,"»":121,"¼":122,"½":123,"¾":124,"¿":125,"À":126,"Á":127,"Â":128,"Ã":129,"Ä":130,"Å":131,"Æ":132,"Ç":133,"È":134,"É":135,"Ê":136,"Ë":137,"Ì":138,"Í":139,"Î":140,"Ï":141,"Ð":142,"Ñ":143,"Ò":144,"Ó":145,"Ô":146,"Õ":147,"Ö":148,"×":149,"Ø":150,"Ù":151,"Ú":152,"Û":153,"Ü":154,"Ý":155,"Þ":156,"ß":157,"à":158,"á":159,"â":160,"ã":161,"ä":162,"å":163,"æ":164,"ç":165,"è":166,"é":167,"ê":168,"ë":169,"ì":170,"í":171,"î":172,"ï":173,"ð":174,"ñ":175,"ò":176,"ó":177,"ô":178,"õ":179,"ö":180,"÷":181,"ø":182,"ù":183,"ú":184,"û":185,"ü":186,"ý":187,"þ":188,"ÿ":189,"Ā":190,"ā":191,"Ă":192,"ă":193,"Ą":194,"ą":195,"Ć":196,"ć":197,"Ĉ":198,"ĉ":199,"Ċ":200,"ċ":201,"Č":202,"č":203,"Ď":204,"ď":205,"Đ":206,"đ":207,"Ē":208,"ē":209,"Ĕ":210,"ĕ":211,"Ė":212,"ė":213,"Ę":214,"ę":215,"Ě":216,"ě":217,"Ĝ":218,"ĝ":219,"Ğ":220,"ğ":221,"Ġ":222,"ġ":223,"Ģ":224,"ģ":225,"Ĥ":226,"ĥ":227,"Ħ":228,"ħ":229,"Ĩ":230,"ĩ":231,"Ī":232,"ī":233,"Ĭ":234,"ĭ":235,"Į":236,"į":237,"İ":238,"ı":239,"Ĳ":240,"ĳ":241,"Ĵ":242,"ĵ":243,"Ķ":244,"ķ":245,"ĸ":246,"Ĺ":247,"ĺ":248,"Ļ":249,"ļ":250,"Ľ":251,"ľ":252,"Ŀ":253,"ŀ":254,"Ł":255,"ł":256,"Ń":257,"ĠĠ":258,"in":259,"Ġ=":260,"um":261,"pr":262,"int":263,"print":264,"Ġ[":265,"(\"":266,"EO":267,"rs":268,"EOS":269,"\",":270,"ers":271,"num":272,"Ġa":273,"me":274,"ĠĠĠ":275,":\",":276,"Ġ\"":277,"re":278,"na":279,"name":280,"bers":281,"numbers":282,"is":283,"ou":284,"ul":285,"Ġb":286,"on":287,"Ġ1":288,"Ġs":289,"te":290,"ge":291,"Ġprint":292,"\")":293,"Ġre":294,"nt":295,"ount":296,".\")":297,"of":298,"Ġ+":299,"Ġis":300,"xt":301,"text":302,"el":303,"Ġ2":304,"or":305,"ev":306,"count":307,"en":308,"if":309,"ult":310,"):":311,"Ġ0":312,"Ġin":313,"rn":314,"tu":315,"Ġretu":316,"Ġreturn":317,"ion":318,"ra":319,"ro":320,"al":321,"de":322,"are":323,"qu":324,"Ġcount":325,"Ġsum":326,"quare":327,"ed":328,"for":329,"se":330,"Ġ>":331,"Ġnum":332,"Ġnumbers":333,"Ġof":334,"erson":335,"age":336,"Ġm":337,"Ġx":338,"else":339,"def":340,"\":":341,"ax":342,"dro":343,"pal":344,"person":345,"tion":346,"Ġ%":347,"Ġname":348,"indro":349,"Ġ==":350,"ersed":351,"ull":352,"even":353,"palindro":354,"palindrome":355,"as":356,"You":357,"nge":358,"sult":359,"Ġi":360,"Ġn":361,"Ġare":362,"Ġsquare":363,"las":364,"Ġ*":365,"Ġ-":366,"Ġy":367,"Ġra":368,"Ġan":369,"Ġrange":370,"\"]":371,":-":372,"::-":373,"[\"":374,"[::-":375,"dd":376,"fi":377,"full":378,"tw":379,"versed":380,"Ġo":381,"Ġtext":382,"Ġif":383,"Ġeven":384,"ĠĠĠĠ":385,"rst":386,"Ġmax":387,"last":388,"\"],":389,"first":390,"two":391,"ĠĠĠĠĠĠĠ":392,"Ġ3":393,"er":394,"il":395,"Ġ4":396,"Ġ18":397,"li":398,"Ġ5":399,"ca":400,"rac":401,"ci":402,"us":403,"lo":404,"ty":405,"Is":406,"Th":407,"hil":408,"ip":409,"ub":410,"Ġ6":411,"umb":412,"Ġ10":413,"Count":414,"Di":415,"Mo":416,"Numb":417,"Sum":418,"Square":419,"dult":420,"ea":421,"ld":422,"sum":423,"vis":424,"whil":425,"Ġz":426,"inor":427,"Ġage":428,"Ġadult":429,"result":430,"Ġresult":431,"Ġ+=":432,"ello":433,"Ġ>=":434,"Ġminor":435,"Ġ-=":436,"The":437,"Number":438,"while":439,"\"}":440,"))":441,",\",":442,"?\",":443,"Add":444,"En":445,"Ev":446,"Full":447,"Hello":448,"Mult":449,"Max":450,"Rev":451,"Sub":452,"dul":453,"ition":454,"pu":455,"trac":456,"yea":457,"{\"":458,"Ġ'":459,"Ġ/":460,"Ġfor":461,"Ġelse":462,"Ġperson":463,"Ġpalindrome":464,"Ġfull":465,"Ġlast":466,"Ġfirst":467,"Ġ{\"":468,"Ġ\")":469,"reversed":470,"our":471,"Ġ12":472,"ter":473,"\"))":474,"Ġreversed":475,"Ġinpu":476,"Ġyour":477,"Ġand":478,"Ġodd":479,"Ġold":480,"lica":481,"city":482,"iplica":483,"Divis":484,"Modul":485,"Addition":486,"Enter":487,"Even":488,"Multiplica":489,"Reversed":490,"Subtrac":491,"years":492,"Ġinput":493,"Division":494,"Modulus":495,"Multiplication":496,"Subtraction":497,"Ġ7":498,"Ġ8":499,"Ġ9":500,"Ġ11":501,"Ġ13":502,"ar":503,"Ġ14":504,"10":505,"Ġ30":506,"Ġ20":507,"Ġ25":508,"lev":509,"level":510,"an":511,"Ġ15":512,"Ġ40":513,"Ġ60":514,"ia":515,"Ġ35":516,"Ġ45":517,"Ġ50":518,"12":519,"30":520,"Ġ24":521,"Ġ55":522,"Ġ65":523,"Ġ100":524,"Ġ105":525,"Ġ120":526,"Ġ125":527,"Ġ70":528,"Ġ75":529,"Ġ80":530,"Ġ85":531,"Ġ90":532,"Ġ95":533,"Ġ110":534,"Ġ115":535,"Ġ130":536,"Ġ135":537,"11":538,"dar":539,"ez":540,"ma":541,"st":542,"tor":543,"Ġ22":544,"Ġ27":545,"Ġ28":546,"rotor":547,"20":548,"am":549,"et":550,"gas":551,"la":552,"le":553,"ph":554,"son":555,"tin":556,"Ġ16":557,"Ġ21":558,"Ġ23":559,"Ġ26":560,"race":561,"Ġ140":562,"15":563,"40":564,"60":565,"80":566,"Ch":567,"Ja":568,"Mar":569,"at":570,"agas":571,"ck":572,"dam":573,"fer":574,"no":575,"net":576,"sc":577,"sagas":578,"th":579,"va":580,"refer":581,"Ġ17":582,"Ġ19":583,"tenet":584,"Ġ29":585,"radar":586,"Ġ32":587,"Ġ42":588,"car":589,"Ġ145":590,"madam":591,"stat":592,"tinez":593,"racecar":594,"Jack":595,"Martinez":596,"noon":597,"stats":598,"13":599,"21":600,"25":601,"70":602,"90":603,"El":604,"Jo":605,"Lo":606,"Oli":607,"San":608,"go":609,"ic":610,"ix":611,"per":612,"ver":613,"vil":614,"Ġ33":615,"Ġ34":616,"Ġ36":617,"Ġ38":618,"Ġ39":619,"Ġ44":620,"Ġ48":621,"Ġ54":622,"phia":623,"ville":624,"16":625,"18":626,"110":627,"130":628,"24":629,"26":630,"27":631,"36":632,"45":633,"50":634,"51":635,"66":636,"An":637,"Ava":638,"Bo":639,"Da":640,"Em":641,"Gar":642,"Hen":643,"Han":644,"Iv":645,"Ka":646,"Lu":647,"Lia":648,"Me":649,"Mas":650,"Mil":651,"Mia":652,"No":653,"So":654,"Wil":655,"ab":656,"ah":657,"ava":658,"cs":659,"cas":660,"derson":661,"esc":662,"gan":663,"hn":664,"ho":665,"har":666,"ir":667,"ied":668,"java":669,"ler":670,"oe":671,"py":672,"pesc":673,"ry":674,"rus":675,"rip":676,"rub":677,"vic":678,"ĠA":679,"ella":680,"elix":681,"ified":682,"ala":683,"deified":684,"ash":685,"Ġ31":686,"Ġ37":687,"Ġ43":688,"Ġ52":689,"Ġ57":690,"Ġ58":691,"cia":692,"civic":693,"typesc":694,"Isab":695,"Ġ63":696,"Ġ69":697,"100":698,"Ġ150":699,"120":700,"dart":701,"ston":702,"Char":703,"scala":704,"thon":705,"Jackson":706,"Ella":707,"John":708,"Oliver":709,"perl":710,"Anderson":711,"Garcia":712,"Henry":713,"Ivy":714,"Kate":715,"Lucas":716,"Liam":717,"Mason":718,"Miller":719,"Noah":720,"Sophia":721,"cshar":722,"python":723,"rust":724,"ript":725,"ruby":726,"elixir":727,"typescript":728,"Isabella":729,"csharp":730}