{"<s>":0,"</s>":1,"[PAD]":2,"!":3,"\"":4,"#":5,"$":6,"%":7,"&":8,"'":9,"(":10,")":11,"*":12,"+":13,",":14,"-":15,".":16,"/":17,"0":18,"1":19,"2":20,"3":21,"4":22,"5":23,"6":24,"7":25,"8":26,"9":27,":":28,";":29,"<":30,"=":31,">":32,"?":33,"@":34,"A":35,"B":36,"C":37,"D":38,"E":39,"F":40,"G":41,"H":42,"I":43,"J":44,"K":45,"L":46,"M":47,"N":48,"O":49,"P":50,"Q":51,"R":52,"S":53,"T":54,"U":55,"V":56,"W":57,"X":58,"Y":59,"Z":60,"[":61,"\\":62,"]":63,"^":64,"_":65,"`":66,"a":67,"b":68,"c":69,"d":70,"e":71,"f":72,"g":73,"h":74,"i":75,"j":76,"k":77,"l":78,"m":79,"n":80,"o":81,"p":82,"q":83,"r":84,"s":85,"t":86,"u":87,"v":88,"w":89,"x":90,"y":91,"z":92,"{":93,"|":94,"}":95,"~":96,"¡":97,"¢":98,"£":99,"¤":100,"¥":101,"¦":102,"§":103,"¨":104,"©":105,"ª":106,"«":107,"¬":108,"®":109,"¯":110,"°":111,"±":112,"²":113,"³":114,"´":115,"µ":116,"¶":117,"·":118,"¸":119,"¹":120,"º":121,"»":122,"¼":123,"½":124,"¾":125,"¿":126,"À":127,"Á":128,"Â":129,"Ã":130,"Ä":131,"Å":132,"Æ":133,"Ç":134,"È":135,"É":136,"Ê":137,"Ë":138,"Ì":139,"Í":140,"Î":141,"Ï":142,"Ð":143,"Ñ":144,"Ò":145,"Ó":146,"Ô":147,"Õ":148,"Ö":149,"×":150,"Ø":151,"Ù":152,"Ú":153,"Û":154,"Ü":155,"Ý":156,"Þ":157,"ß":158,"à":159,"á":160,"â":161,"ã":162,"ä":163,"å":164,"æ":165,"ç":166,"è":167,"é":168,"ê":169,"ë":170,"ì":171,"í":172,"î":173,"ï":174,"ð":175,"ñ":176,"ò":177,"ó":178,"ô":179,"õ":180,"ö":181,"÷":182,"ø":183,"ù":184,"ú":185,"û":186,"ü":187,"ý":188,"þ":189,"ÿ":190,"Ā":191,"ā":192,"Ă":193,"ă":194,"Ą":195,"ą":196,"Ć":197,"ć":198,"Ĉ":199,"ĉ":200,"Ċ":201,"ċ":202,"Č":203,"č":204,"Ď":205,"ď":206,"Đ":207,"đ":208,"Ē":209,"ē":210,"Ĕ":211,"ĕ":212,"Ė":213,"ė":214,"Ę":215,"ę":216,"Ě":217,"ě":218,"Ĝ":219,"ĝ":220,"Ğ":221,"ğ":222,"Ġ":223,"ġ":224,"Ģ":225,"ģ":226,"Ĥ":227,"ĥ":228,"Ħ":229,"ħ":230,"Ĩ":231,"ĩ":232,"Ī":233,"ī":234,"Ĭ":235,"ĭ":236,"Į":237,"į":238,"İ":239,"ı":240,"Ĳ":241,"ĳ":242,"Ĵ":243,"ĵ":244,"Ķ":245,"ķ":246,"ĸ":247,"Ĺ":248,"ĺ":249,"Ļ":250,"ļ":251,"Ľ":252,"ľ":253,"Ŀ":254,"ŀ":255,"Ł":256,"ł":257,"Ń":258,"ĠĠ":259,"in":260,"Ġ=":261,"um":262,"pr":263,"int":264,"print":265,"(\"":266,"</":267,"rs":268,"Ġ</":269,"\",":270,"Ġa":271,"ers":272,"num":273,"me":274,"ĠĠĠ":275,":\",":276,"Ġ\"":277,"re":278,"na":279,"name":280,"bers":281,"numbers":282,"is":283,"ou":284,"Ġprint":285,"ul":286,"Ġb":287,"on":288,"Ġ1":289,"Ġs":290,"Ġre":291,"te":292,"ge":293,"\")":294,"nt":295,"ount":296,".\")":297,"of":298,"Ġ+":299,"Ġis":300,"Ġf":301,"xt":302,"text":303,"el":304,"Ġ2":305,"or":306,"ev":307,"count":308,"en":309,"if":310,"Ġcount":311,"Ġnumbers":312,"ult":313,"):":314,"Ġ0":315,"Ġx":316,"Ġin":317,"Ġnum":318,"rn":319,"tu":320,"Ġretu":321,"Ġreturn":322,"ion":323,"Ġname":324,"ra":325,"ro":326,"al":327,"de":328,"are":329,"qu":330,"Ġsum":331,"quare":332,"ed":333,"se":334,"Ġ>":335,"Ġof":336,"erson":337,"Ġm":338,"Ġde":339,"else":340,"Ġdef":341,"\":":342,"ax":343,"dro":344,"pal":345,"person":346,"tion":347,"Ġ%":348,"Ġtext":349,"Ġev":350,"indro":351,"Ġ==":352,"ersed":353,"ull":354,"palindro":355,"Ġeven":356,"palindrome":357,"as":358,"You":359,"nge":360,"sult":361,"Ġi":362,"Ġn":363,"Ġare":364,"Ġage":365,"Ġsquare":366,"Ġresult":367,"las":368,"Ġ*":369,"Ġ-":370,"Ġ[":371,"Ġy":372,"Ġra":373,"Ġan":374,"Ġfor":375,"Ġrange":376,"\"]":377,":-":378,"::-":379,"[\"":380,"[::-":381,"age":382,"dd":383,"irs":384,"tw":385,"versed":386,"Ġo":387,"Ġif":388,"Ġperson":389,"ĠĠĠĠ":390,"Ġfirs":391,"Ġmax":392,"last":393,"\"],":394,"two":395,"ĠĠĠĠĠĠĠ":396,"Ġfirst":397,"Ġ3":398,"er":399,"il":400,"Ġ4":401,"Ġ18":402,"li":403,"Ġ5":404,"ca":405,"rac":406,"ci":407,"us":408,"lo":409,"ty":410,"Is":411,"Th":412,"hil":413,"ip":414,"ub":415,"Ġ6":416,"umb":417,"Ġ10":418,"Count":419,"Di":420,"Mo":421,"Numb":422,"Sum":423,"Square":424,"dult":425,"ea":426,"for":427,"ld":428,"sum":429,"vis":430,"whil":431,"Ġz":432,"inor":433,"Ġadult":434,"Ġ+=":435,"ello":436,"Ġ>=":437,"Ġminor":438,"Ġ-=":439,"The":440,"Number":441,"while":442,"\"}":443,"))":444,",\",":445,"?\",":446,"Add":447,"En":448,"Ev":449,"Full":450,"Hello":451,"Mult":452,"Max":453,"Rev":454,"Sub":455,"dul":456,"full":457,"ition":458,"pu":459,"trac":460,"yea":461,"{\"":462,"Ġ'":463,"Ġ/":464,"Ġelse":465,"Ġpalindrome":466,"Ġlast":467,"Ġ{\"":468,"Ġ\")":469,"reversed":470,"our":471,"Ġ12":472,"Ġreversed":473,"ter":474,"\"))":475,"Ġfull":476,"Ġinpu":477,"Ġyour":478,"Ġand":479,"Ġodd":480,"Ġold":481,"lica":482,"city":483,"iplica":484,"Divis":485,"Modul":486,"Addition":487,"Enter":488,"Even":489,"Multiplica":490,"Reversed":491,"Subtrac":492,"years":493,"Ġinput":494,"Division":495,"Modulus":496,"Multiplication":497,"Subtraction":498,"Ġ7":499,"Ġ8":500,"Ġ9":501,"Ġ11":502,"Ġ13":503,"ar":504,"Ġ14":505,"10":506,"Ġ30":507,"Ġ20":508,"Ġ25":509,"lev":510,"level":511,"an":512,"Ġ15":513,"Ġ40":514,"Ġ60":515,"ia":516,"Ġ35":517,"Ġ45":518,"Ġ50":519,"12":520,"30":521,"Ġ24":522,"Ġ55":523,"Ġ65":524,"Ġ100":525,"Ġ105":526,"Ġ120":527,"Ġ125":528,"Ġ70":529,"Ġ75":530,"Ġ80":531,"Ġ85":532,"Ġ90":533,"Ġ95":534,"Ġ110":535,"Ġ115":536,"Ġ130":537,"Ġ135":538,"11":539,"dar":540,"ez":541,"ma":542,"st":543,"tor":544,"Ġ22":545,"Ġ27":546,"Ġ28":547,"rotor":548,"20":549,"am":550,"et":551,"gas":552,"la":553,"le":554,"ph":555,"son":556,"tin":557,"Ġ16":558,"Ġ21":559,"Ġ23":560,"Ġ26":561,"race":562,"Ġ140":563,"15":564,"40":565,"60":566,"80":567,"Ch":568,"Ja":569,"Mar":570,"at":571,"agas":572,"ck":573,"dam":574,"fer":575,"no":576,"net":577,"sc":578,"sagas":579,"th":580,"va":581,"refer":582,"Ġ17":583,"Ġ19":584,"tenet":585,"Ġ29":586,"radar":587,"Ġ32":588,"Ġ42":589,"car":590,"Ġ145":591,"madam":592,"stat":593,"tinez":594,"racecar":595,"Jack":596,"Martinez":597,"noon":598,"stats":599,"13":600,"21":601,"25":602,"70":603,"90":604,"El":605,"Jo":606,"Lo":607,"Oli":608,"San":609,"go":610,"ic":611,"ix":612,"per":613,"ver":614,"vil":615,"Ġ33":616,"Ġ34":617,"Ġ36":618,"Ġ38":619,"Ġ39":620,"Ġ44":621,"Ġ48":622,"Ġ54":623,"phia":624,"ville":625,"16":626,"18":627,"110":628,"130":629,"24":630,"26":631,"27":632,"36":633,"45":634,"50":635,"51":636,"66":637,"An":638,"Ava":639,"Bo":640,"Da":641,"Em":642,"Gar":643,"Hen":644,"Han":645,"Iv":646,"Ka":647,"Lu":648,"Lia":649,"Me":650,"Mas":651,"Mil":652,"Mia":653,"No":654,"So":655,"Wil":656,"ab":657,"ah":658,"ava":659,"cs":660,"cas":661,"derson":662,"esc":663,"gan":664,"hn":665,"ho":666,"har":667,"ir":668,"ied":669,"java":670,"ler":671,"oe":672,"py":673,"pesc":674,"ry":675,"rus":676,"rip":677,"rub":678,"vic":679,"ĠA":680,"ella":681,"elix":682,"ified":683,"ala":684,"deified":685,"ash":686,"Ġ31":687,"Ġ37":688,"Ġ43":689,"Ġ52":690,"Ġ57":691,"Ġ58":692,"cia":693,"civic":694,"typesc":695,"Isab":696,"Ġ63":697,"Ġ69":698,"100":699,"Ġ150":700,"120":701,"dart":702,"ston":703,"Char":704,"scala":705,"thon":706,"Jackson":707,"Ella":708,"John":709,"Oliver":710,"perl":711,"Anderson":712,"Garcia":713,"Henry":714,"Ivy":715,"Kate":716,"Lucas":717,"Liam":718,"Mason":719,"Miller":720,"Noah":721,"Sophia":722,"cshar":723,"python":724,"rust":725,"ript":726,"ruby":727,"elixir":728,"typescript":729,"Isabella":730,"csharp":731}