{"<s>":0,"</s>":1,"!":2,"\"":3,"#":4,"$":5,"%":6,"&":7,"'":8,"(":9,")":10,"*":11,"+":12,",":13,"-":14,".":15,"/":16,"0":17,"1":18,"2":19,"3":20,"4":21,"5":22,"6":23,"7":24,"8":25,"9":26,":":27,";":28,"<":29,"=":30,">":31,"?":32,"@":33,"A":34,"B":35,"C":36,"D":37,"E":38,"F":39,"G":40,"H":41,"I":42,"J":43,"K":44,"L":45,"M":46,"N":47,"O":48,"P":49,"Q":50,"R":51,"S":52,"T":53,"U":54,"V":55,"W":56,"X":57,"Y":58,"Z":59,"[":60,"\\":61,"]":62,"^":63,"_":64,"`":65,"a":66,"b":67,"c":68,"d":69,"e":70,"f":71,"g":72,"h":73,"i":74,"j":75,"k":76,"l":77,"m":78,"n":79,"o":80,"p":81,"q":82,"r":83,"s":84,"t":85,"u":86,"v":87,"w":88,"x":89,"y":90,"z":91,"{":92,"|":93,"}":94,"~":95,"¡":96,"¢":97,"£":98,"¤":99,"¥":100,"¦":101,"§":102,"¨":103,"©":104,"ª":105,"«":106,"¬":107,"®":108,"¯":109,"°":110,"±":111,"²":112,"³":113,"´":114,"µ":115,"¶":116,"·":117,"¸":118,"¹":119,"º":120,"»":121,"¼":122,"½":123,"¾":124,"¿":125,"À":126,"Á":127,"Â":128,"Ã":129,"Ä":130,"Å":131,"Æ":132,"Ç":133,"È":134,"É":135,"Ê":136,"Ë":137,"Ì":138,"Í":139,"Î":140,"Ï":141,"Ð":142,"Ñ":143,"Ò":144,"Ó":145,"Ô":146,"Õ":147,"Ö":148,"×":149,"Ø":150,"Ù":151,"Ú":152,"Û":153,"Ü":154,"Ý":155,"Þ":156,"ß":157,"à":158,"á":159,"â":160,"ã":161,"ä":162,"å":163,"æ":164,"ç":165,"è":166,"é":167,"ê":168,"ë":169,"ì":170,"í":171,"î":172,"ï":173,"ð":174,"ñ":175,"ò":176,"ó":177,"ô":178,"õ":179,"ö":180,"÷":181,"ø":182,"ù":183,"ú":184,"û":185,"ü":186,"ý":187,"þ":188,"ÿ":189,"Ā":190,"ā":191,"Ă":192,"ă":193,"Ą":194,"ą":195,"Ć":196,"ć":197,"Ĉ":198,"ĉ":199,"Ċ":200,"ċ":201,"Č":202,"č":203,"Ď":204,"ď":205,"Đ":206,"đ":207,"Ē":208,"ē":209,"Ĕ":210,"ĕ":211,"Ė":212,"ė":213,"Ę":214,"ę":215,"Ě":216,"ě":217,"Ĝ":218,"ĝ":219,"Ğ":220,"ğ":221,"Ġ":222,"ġ":223,"Ģ":224,"ģ":225,"Ĥ":226,"ĥ":227,"Ħ":228,"ħ":229,"Ĩ":230,"ĩ":231,"Ī":232,"ī":233,"Ĭ":234,"ĭ":235,"Į":236,"į":237,"İ":238,"ı":239,"Ĳ":240,"ĳ":241,"Ĵ":242,"ĵ":243,"Ķ":244,"ķ":245,"ĸ":246,"Ĺ":247,"ĺ":248,"Ļ":249,"ļ":250,"Ľ":251,"ľ":252,"Ŀ":253,"ŀ":254,"Ł":255,"ł":256,"Ń":257,"ĠĠ":258,"in":259,"int":260,"pr":261,"Ġ=":262,"print":263,"er":264,"Ġ<":265,"Ġ</":266,"is":267,"(\"":268,"\",":269,"um":270,"ist":271,":\",":272,"ĠĠĠ":273,"list":274,"Ġ\"":275,"ed":276,"ers":277,"num":278,"Ġ2":279,"el":280,"Ġm":281,"me":282,"re":283,"Ġa":284,"numb":285,"na":286,"or":287,"al":288,"numbers":289,"Ġx":290,"nt":291,"Ġf":292,"le":293,"Ġ3":294,"ge":295,"Ġ1":296,"Ġs":297,"Ġc":298,"Ġ[":299,"\")":300,"it":301,"00":302,"Ġ{":303,"de":304,"Ġin":305,"ra":306,"name":307,"])":308,"\":":309,"Ġprint":310,"ct":311,"Ġ4":312,"on":313,"Ġmy":314,"Ġre":315,"Ġ5":316,"ar":317,"at":318,"ul":319,"Ġt":320,"ĠĠĠĠ":321,"elf":322,"ĠĠĠĠĠĠĠ":323,"nge":324,"Ġo":325,"Ġlist":326,"):":327,"ou":328,"di":329,"tu":330,"Ġ*":331,"Ġb":332,"range":333,"Ġ0":334,"en":335,"Ġrange":336,"Ġfor":337,"my":338,"ot":339,"dict":340,"val":341,"la":342,"qu":343,"Ġde":344,"Ġnumbers":345,"Ġdef":346,"se":347,"Ġi":348,"10":349,"ult":350,"po":351,"ue":352,"Ġ+":353,"Ġ20":354,"ex":355,"self":356,"Ġis":357,"value":358,"ev":359,"ion":360,"st":361,"))":362,".\")":363,"ub":364,"es":365,"rn":366,"Ġy":367,"Ġel":368,"Ġfi":369,"Ġretu":370,"Ġreturn":371,"pp":372,"Ġ25":373,"Ġ30":374,"Ġof":375,"otal":376,"[:":377,"mb":378,"Ġ{\"":379,"ount":380,"ax":381,"Ġ%":382,"Ġ==":383,"ersed":384,"ment":385,"ared":386,"quared":387,"pe":388,"ter":389,"Ġname":390,"Ġ10":391,"age":392,"dd":393,"ro":394,"\"]":395,"ement":396,"()":397,"lo":398,"Ġsum":399,"Ġif":400,"ru":401,"Ġn":402,"Ġpo":403,"Ġcount":404,"its":405,"ext":406,"[::":407,"ruits":408,"Ġnum":409,"[\"":410,"fter":411,"ser":412,"Ġvalue":413,"Ġafter":414,"even":415,"ce":416,"ip":417,"Ġmin":418,"Ġmax":419,"Ġ40":420,"Ġd":421,"Ġ15":422,"Ġtotal":423,"ultip":424,"([":425,"List":426,"__":427,"fruits":428,"versed":429,"ing":430,"Ġself":431,"Ġcub":432,"Ġfile":433,"[::-":434,"ci":435,"co":436,"da":437,"em":438,"th":439,"Ġ**":440,"Ġelement":441,"15":442,"ent":443,"li":444,"ry":445,"Ġj":446,"ree":447,"Ġ50":448,"fi":449,"for":450,"ted":451,"Ġ-":452,"ind":453,"lamb":454,"lambda":455,"Th":456,"ple":457,"Ġ200":458,"\"}":459,")]":460,"are":461,"cle":462,"gra":463,"if":464,"ma":465,"nd":466,"pal":467,"rst":468,"Ġ>":469,"Ġw":470,"ined":471,"Ġreversed":472,"ated":473,"ull":474,"quare":475,"set":476,"pped":477,"peated":478,"rome":479,"indrome":480,"palindrome":481,"20":482,"cat":483,"hi":484,"od":485,"of":486,"sult":487,"Ġ35":488,"mbined":489,"100":490,"Bo":491,"ana":492,"app":493,"ke":494,"ly":495,"sum":496,"squared":497,"Ġeven":498,"erson":499,"Ġmultip":500,"Ġ300":501,"Ġsquared":502,"ith":503,"ition":504,"Ġtext":505,"Ġcounter":506,"sert":507,"cies":508,"Ali":509,"act":510,"ged":511,"ial":512,"mer":513,"ri":514,"ss":515,"ye":516,"Ġdict":517,"orial":518,"Ġco":519,"Ġ[\"":520,"Ġ{}":521,"Ġ400":522,"Ġodd":523,"Ġ+=":524,"pecies":525,"Alice":526,"actorial":527,"**":528,"person":529,"ve":530,"ello":531,"Ġand":532,"dent":533,"Ġ55":534,"Ġto":535,"tudent":536,"Ġelse":537,"The":538,"grade":539,"Bob":540,"={":541,"Hello":542,"Rev":543,"You":544,"][":545,"ble":546,"ch":547,"mat":548,"ona":549,"pen":550,"sition":551,"tx":552,"user":553,"Ġ__":554,"Ġuser":555,"init":556,"else":557,"Ġas":558,"Ġare":559,"number":560,"ntent":561,"Ġsquare":562,"Ġcla":563,"\"))":564,"Ġrepeated":565,"Ġresult":566,"Ġopen":567,"tuple":568,"last":569,"Ġfirst":570,"Ġpopped":571,"Ġdel":572,"__(":573,"Ġcubed":574,"Ġwith":575,"rix":576,"Ġ{}.":577,"Reversed":578,"txt":579,"Ġclass":580,"Cub":581,"Po":582,"Total":583,"bana":584,"ena":585,"plo":586,"Ġ7":587,"Ġfactorial":588,"Ġ45":589,"oncat":590,"Ġ500":591,"our":592,"position":593,"emplo":594,"Ġmultiply":595,"cher":596,"banana":597,"enated":598,"oncatenated":599,"employe":600,"\"])":601,"Max":602,"gree":603,"og":604,"pla":605,"text":606,"ut":607,"uct":608,"wer":609,"Ġ6":610,"Ġ9":611,"Ġit":612,"Ġnumber":613,"ispla":614,"element":615,"Ġage":616,"orted":617,"\"],":618,"Ġpower":619,"\"},":620,"odel":621,"merged":622,"greet":623,"isplay":624,"!\")":625,"Min":626,"et":627,"put":628,"rr":629,"},":630,"Ġ(":631,"Ġ/":632,"Ġex":633,"Ġlambda":634,"insert":635,"end":636,"pop":637,"three":638,"fied":639,"apple":640,"!=":641,"50":642,"Di":643,"Fi":644,"Jo":645,"Pro":646,"Wel":647,"am":648,"ase":649,"hn":650,"ld":651,"rit":652,"species":653,"vis":654,"Ġ'":655,"Ġpr":656,"Ġle":657,"Ġperson":658,"Ġ!=":659,"Ġma":660,"ord":661,"les":662,"Ġ100":663,"Ġspecies":664,"Ġsorted":665,"Ġ{**":666,"Ġinsert":667,"ata":668,"root":669,"\"][\"":670,"Ġcubes":671,"come":672,"append":673,"tudents":674,"employees":675,"greeting":676,"Ġexp":677,"Divis":678,"John":679,"Welcome":680,"ample":681,"Ġinsertion":682,"Division":683,")}":684,",\",":685,":])":686,"?\",":687,"Ent":688,"Err":689,"Full":690,"Is":691,"La":692,"Len":693,"Mo":694,"Multip":695,"Re":696,"Sum":697,"Square":698,"Val":699,"][::-":700,"ad":701,"ault":702,"add":703,"able":704,"bona":705,"cit":706,"cci":707,"dog":708,"duct":709,"full":710,"ger":711,"gth":712,"id":713,"im":714,"iona":715,"lter":716,"mo":717,"med":718,"ok":719,"odd":720,"pt":721,"tw":722,"whi":723,"writ":724,"ycle":725,"}\")":726,"Ġ8":727,"Ġz":728,"Ġint":729,"Ġna":730,"Ġpalindrome":731,"Ġlast":732,"ĠWelcome":733,"erable":734,"ish":735,"Ġ\")":736,"Ġmat":737,"reversed":738,"read":739,"remo":740,"Ġfruits":741,"Ġfull":742,"lear":743,"Ġ18":744,"Ġcycle":745,"Ġclear":746,"Ġ[[":747,"Ġinput":748,"]))":749,"Ġtry":750,"dified":751,"exce":752,"Ġyour":753,"pping":754,"Ġpopping":755,"combined":756,"content":757,"ems":758,"filter":759,"format":760,"Ġ-=":761,"clear":762,"map":763,"make":764,"Ġ>=":765,"hicle":766,"Ġdictiona":767,"Ġcombined":768,"Ġcontent":769,"][-":770,"matrix":771,"Ġdelet":772,"Ġ{}.\"":773,"Popped":774,"cherry":775,"First":776,"Product":777,"Ġlen":778,"Ġmake":779,"Enter":780,"Error":781,"Last":782,"Length":783,"Modified":784,"Repeated":785,"bonacci":786,"city":787,"two":788,"while":789,"write":790,"Ġnamed":791,"Ġmatrix":792,"remove":793,"Ġclearing":794,"except":795,"Ġdictionary":796,"Ġdeletion":797,"Co":798,"Count":799,"In":800,"Next":801,"Squared":802,"an":803,"acher":804,"base":805,"car":806,"cub":807,"display":808,"eacher":809,"ir":810,"imer":811,"lor":812,"lar":813,"model":814,"uth":815,"}.\")":816,"ĠC":817,"ero":818,"erat":819,"erged":820,"Ġ22":821,"Ġmodel":822,"reed":823,"result":824,"Ġal":825,"Ġ12":826,"itle":827,"deq":828,"dex":829,"ars":830,"Ġtimer":831,"Ġold":832,"Ġfibonacci":833,"low":834,"Ġnot":835,"Ġvalues":836,"Ġdisplay":837,"Ġcube":838,"Ġmultiples":839,"Ġusername":840,"Ġsquares":841,"Cubed":842,"Ġiterable":843,"Combined":844,"cubed":845,"ird":846,"uthor":847,"45":848,"500":849,"An":850,"Add":851,"Ch":852,"Concatenated":853,"De":854,"Dev":855,"Em":856,"Factorial":857,"Mat":858,"Mod":859,"Mana":860,"Num":861,"Sub":862,"Student":863,"Teacher":864,"ange":865,"ber":866,"concatenated":867,"dult":868,"fish":869,"ime":870,"mal":871,"multip":872,"ming":873,"not":874,"op":875,"ow":876,"ofi":877,"ook":878,"rp":879,"tra":880,"us":881,"wim":882,"yth":883,"ĠF":884,"Ġent":885,"Ġgrade":886,"Ġemployees":887,"Ġgreeting":888,"ĠVal":889,"ĠAn":890,"ine":891,"elop":892,"Ġan":893,"Ġadult":894,"orange":895,"lest":896,"gest":897,"Ġconcatenated":898,"items":899,"iterat":900,"ction":901,"onent":902,"ark":903,"ulus":904,"Ġth":905,"ound":906,"ouble":907,"Ġby":908,"ence":909,"valid":910,"Ġdeq":911,"Ġdefault":912,"ueError":913,"Ġelif":914,"Ġminor":915,"Ġdata":916,"licat":917,"This":918,"Ġ2000":919,"Ġword":920,"hirp":921,"oduct":922,"years":923,"vehicle":924,"Cubes":925,"Point":926,"employee":927,"Ġexponent":928,"Multiplicat":929,"Invalid":930,"largest":931,"Ġallow":932,"dexed":933,"Addition":934,"Develop":935,"Math":936,"Modulus":937,"Manager":938,"Number":939,"Subtra":940,"mallest":941,"multiply":942,"ofile":943,"ython":944,"ĠValueError":945,"iterator":946,"Multiplication":947,"Ġallowed":948,"Developer":949,"Subtraction":950,"30":951,"Bird":952,"Dif":953,"Dog":954,"Ev":955,"Mi":956,"Mr":957,"Merged":958,"Odd":959,"Person":960,"Python":961,"Qu":962,"Rem":963,"Sa":964,"Sm":965,"Students":966,"To":967,"Ve":968,"Zero":969,"aind":970,"author":971,"breed":972,"bird":973,"book":974,"count":975,"data":976,"eger":977,"eow":978,"fer":979,"four":980,"fault":981,"gi":982,"go":983,"ient":984,"ified":985,"igi":986,"mming":987,"no":988,"ol":989,"par":990,"pine":991,"son":992,"sage":993,"student":994,"students":995,"sample":996,"sound":997,"total":998,"tment":999,"title":1000,"vel":1001,"vot":1002,"wor":1003,"word":1004,"ys":1005,"Ġp":1006,"ĠBo":1007,"Ġroot":1008,"ĠStudent":1009,"ĠPoint":1010,"Ġemployee":1011,"Ġlargest":1012,"ĠBird":1013,"ĠDog":1014,"ĠPerson":1015,"ĠVe":1016,"ĠZero":1017,"Ġvot":1018,"Ġ21":1019,"Ġ24":1020,"Ġ28":1021,"Ġmes":1022,"Ġmerged":1023,"Ġmeow":1024,"mess":1025,"Ġarr":1026,"Ġauthor":1027,"level":1028,"Ġ16":1029,"Ġ17":1030,"Ġstudents":1031,"Ġswim":1032,"Ġsmallest":1033,"Ġcour":1034,"Ġchirp":1035,"000":1036,"deified":1037,"depar":1038,"race":1039,"arli":1040,"Ġtitle":1041,"Ġbase":1042,"Ġbreed":1043,"Ġbark":1044,"otient":1045,"que":1046,"ses":1047,"example":1048,"Ġeligi":1049,"\"]},":1050,"log":1051,"Ġdouble":1052,"Ġ1500":1053,"color":1054,"dam":1055,"Ġelements":1056,"five":1057,"Three":1058,"\"}}":1059,"grape":1060,"gramming":1061,"madam":1062,"1000":1063,"keys":1064,"Ġ3000":1065,"Ġcolor":1066,"Cube":1067,"Ġ65":1068,"Ġitem":1069,"Ġitems":1070,"Ġprime":1071,"Ġproduct":1072,"Ġprofile":1073,"Ġ1000":1074,"Johnson":1075,"DivisionError":1076,"Multiples":1077,"Squares":1078,"Valid":1079,"imal":1080,"Ġzero":1081,"Ġinteger":1082,"ĠCar":1083,"ĠCat":1084,"Charli":1085,"Deque":1086,"Emma":1087,"notes":1088,"ĠFish":1089,"Ġenter":1090,"ĠAnimal":1091,"Ġthe":1092,"Differ":1093,"Even":1094,"Quotient":1095,"Remaind":1096,"Sara":1097,"Smith":1098,"counter":1099,"noon":1100,"pineapple":1101,"ĠBook":1102,"ĠVehicle":1103,"ĠZeroDivisionError":1104,"Ġvote":1105,"Ġmessage":1106,"message":1107,"Ġcourses":1108,"department":1109,"racecar":1110,"Ġeligible":1111,"Charlie":1112,"Difference":1113,"Remainder":1114}