#version: 0.2
i n
Ġ Ġ
e r
p r
in t
pr int
l e
s t
Ġ =
Ġ <
Ġ< /
Ġ #
a m
l i
( "
u m
Ġ e
" ,
li st
a l
o n
o t
er s
e n
Ġ a
: ",
ĠĠ Ġ
r e
n um
p le
Ġ A
Ġ "
Ġe x
am ple
Ġ f
i on
num b
ĠA n
o r
Ġex ample
g e
h er
ot her
ĠAn other
numb ers
Ġ 2
Ġ c
Ġ m
a t
Ġ list
e d
v al
Ġ x
Ġ in
c t
s e
u e
val ue
Ġ o
Ġ t
" )
Ġ 1
Ġ i
Ġ s
a r
d e
n am
en t
a n
i t
Ġ [
Ġ {
Ġ 3
] )
nam e
in g
Ġ 4
d i
o m
" :
Ġ re
l f
m y
m ent
ct ion
se lf
an ge
a re
q u
r ange
Ġ print
qu are
u n
Ġ *
Ġ numbers
ĠĠ ĠĠ
le ment
ĠĠĠĠ ĠĠĠ
value s
) :
Ġ range
d d
o p
Ġe lement
Ġf or
Ġo f
u l
Ġ 0
Ġ 5
e s
Ġ y
h e
Ġf i
l o
t er
u r
Ġ b
l a
v ers
Ġt o
a x
Ġi s
1 0
u b
ot al
Ġ2 0
de f
. ")
L i
a ge
v en
Ġ +
Ġ p
Li st
p e
s er
s ion
Ġ n
Ġs um
quare d
Ġfi le
R e
Ġc om
) )
u t
Ġ %
Ġ1 0
Ġi f
di ct
un ction
e l
Ġ 6
Ġ value
Ġm y
[ :
e h
t ur
Ġ C
Ġ di
in d
pr eh
en sion
Ġa n
Ġ{ "
Ġ3 0
Ġre tur
ction ar
vers ed
Ġcom preh
Ġretur n
Ġcompreh ension
c k
e x
( )
a p
c at
e t
f or
o un
r om
Ġ name
Ġf unction
Ġm ax
ul t
c e
Ġ values
Ġ2 5
s quared
Ġ= =
Ġm in
at ed
[: :
Ġdi ctionar
d a
p ut
( [
[ "
_ _
b da
f ter
i m
m at
o w
s s
s um
Ġ u
Ġ self
Ġ def
am bda
Ġa fter
Ġo p
it h
Ġ4 0
op p
he ck
la ss
ub ed
f r
u it
Ġ num
ge t
fr uit
fruit s
" ]
a k
i r
l ambda
o l
o dd
r ing
w o
w or
Ġe ven
al ind
on cat
ers on
at ion
se t
Ġo dd
Ġs quare
Ġ5 0
rom e
[:: -
Ġdictionar y
alind rome
oncat en
1 5
b le
i s
v e
Ġ 8
Ġt otal
Ġ1 5
" }
) ]
i x
i es
r a
r ix
u ple
w ith
y e
Ġ -
Ġ j
Ġ st
Ġ lo
Ġ List
le ar
Ġc heck
at e
de l
it ion
es s
pe ated
ser t
opp ed
ak e
Ġst ring
Ġlo op
e st
o d
t otal
it e
ex t
D i
a d
a ct
c c
e ven
i p
i al
m p
r y
t h
v i
Ġ >
Ġ F
Ġ S
Ġ Re
Ġ get
er ge
numb er
or ial
Ġ* *
lo ye
la st
vers e
Ġan d
ult ip
ol or
wor d
act orial
mp loye
erge d
a ble
g re
o u
r ite
Ġ v
Ġ le
Ġ3 5
ul l
oun t
able s
! =
* *
= {
D e
T he
] [
c ing
c om
c ul
c lass
c ubed
c ies
e mploye
f i
g ra
g th
i f
l se
l ter
m o
o f
o g
o di
p t
p erson
s ing
s ult
t x
t ent
t wo
t uple
} .
Ġ __
Ġ !=
in it
er ation
le t
li cing
Ġe lse
al cul
on tent
Ġa s
Ġa ge
Ġf actorial
Ġc lass
Ġin put
Ġt he
") )
Ġ1 2
Ġs licing
Ġ{ }.
Ġelement s
Ġ+ =
Ġp ow
Ġp alindrome
pe cies
Re versed
el se
ex ce
__ (
im er
mat rix
Ġu ser
Ġu sing
Ġop en
Ġop eration
ir st
est ed
cc ess
gre et
Ġle n
tx t
Ġpow er
exce pt
1 2
2 0
A li
M ax
c ar
l y
w rite
in e
re versed
Ġ1 8
Ġ4 5
Ġre versed
ut put
Ali ce
" ])
B o
H el
M in
M odi
T otal
Y ou
a se
b in
d og
h i
i c
l d
m ake
m ultip
m erged
o s
p ar
p alindrome
p os
r st
r or
t ext
w hi
Ġ /
Ġ 9
Ġ P
Ġ de
Ġ lambda
Ġ last
Ġ De
Ġa re
ĠA ccess
Ġex p
Ġf rom
Ġc ub
Ġc oncaten
Ġc lear
Ġc olor
Ġc alcul
Ġm ake
Ġin sert
Ġt wo
Ġt imer
Ġs quared
an a
Ġre sult
dd ition
Ġfi rst
Ġn ested
oun d
"] ,
"} ,
gra de
Ġoperation s
Bo b
Hel lo
bin ed
multip ly
pos ition
whi le
Ġde let
! ")
E n
J o
W el
h n
o ur
s p
Ġc ount
Ġin de
Ġt ext
Ġre verse
oun ter
ow n
get ables
ve getables
Ġv ot
com e
Jo hn
Wel come
Ġinde x
) }
: ])
? ",
C ub
C ubed
E r
E ven
F irst
I n
I s
L a
L en
P opped
S um
S quare
] [::-
a dd
b an
b ase
c ur
c lear
c olor
c ontent
d ent
d own
e lement
f y
f irst
f ine
g i
g ing
h od
i ve
i ables
m a
m in
m ax
m ap
m et
m ess
o del
o utput
p en
p op
p opped
r ith
s pecies
s ound
s ive
t ing
t ment
t ry
u ct
u ser
u dent
v el
w ap
} ,
} ")
Ġ '
Ġ (
Ġ 7
Ġ B
Ġ L
Ġ M
Ġ T
Ġ or
Ġ nam
Ġ with
Ġ Di
Ġ number
Ġ word
in sert
er o
er ging
st udent
li cat
li gi
Ġa rith
re peated
re ad
re mo
Ġ" )
ĠAn im
Ġc ubed
Ġc ontent
Ġm at
Ġm et
Ġm odel
Ġo ld
Ġs pecies
ar s
ar iables
de par
Ġ[ "
Ġ[ [
Ġ{ **
]) )
Ġre peated
Ġfor mat
Ġy our
lo ck
Ġb lock
la y
Ġp opp
Ġp opped
pe at
Re peated
ĠC ar
ĠC heck
ĠC oncaten
ctionar y
ap ple
ap pen
for mat
Ġdictionar ies
"] ["
Ġsquare s
oncaten ated
Ġ- =
od uct
Di vi
Ġ> =
ĠF unction
ĠF ind
ĠS um
ĠRe verse
ultip licat
Ġv ariables
][ -
employe e
employe es
fi ed
fi lter
mo del
Ġ{}. "
Ġuser name
greet ing
Ġlen gth
Modi fied
ĠP erson
ĠDe fine
Ġcub e
Ġconcaten ation
Ġclear ing
Ġcalcul ate
Ġinsert ion
Ġdelet ion
En ter
sp lay
Ġvot e
Er ror
La st
Len gth
ban ana
cur sive
met ic
mess age
Ġnam ed
ĠDi ctionary
student s
ligi ble
Ġarith metic
remo ve
ĠAnim al
Ġmat rix
Ġmet hod
depar tment
Ġformat ting
Ġpopp ing
ĠConcaten ate
appen d
Divi sion
ultiplicat ion
, ",
C om
F ull
P r
a s
e ow
f ull
g er
h ir
h is
r ot
t e
Ġ G
Ġ z
Ġ int
Ġ write
Ġ Welcome
Ġe ligible
ple te
Ġf ull
Ġ2 4
Ġ2 8
Ġc ounter
an d
ir d
hir p
A ddition
C ar
C an
C ur
C oncatenated
D a
F actorial
M od
M erged
M ana
M ultiplication
N um
N ested
O dd
P y
Q u
S ub
S quared
T im
T his
U ser
V al
W rite
Z ero
a v
a li
b r
b er
c her
c it
c ub
c oncatenated
d at
d ult
e ars
f f
g h
h r
h and
i ent
i lter
k s
l ing
m ing
m ad
n o
n ot
o li
o op
o cc
p ine
r am
r ent
s on
s ample
s quare
t ring
t ra
t est
t imer
u s
v ali
} .")
Ġ I
Ġ er
Ġ am
Ġ set
Ġ greet
Ġ Modi
Ġ while
Ġ Even
Ġ In
Ġ Nested
Ġ User
Ġ Val
Ġ Write
Ġ Zero
Ġ hand
in put
er en
pr oduct
le vel
Ġe mploye
ot ient
Ġa ccess
Ġa ddition
Ġa dult
re ate
re sult
ĠA ge
ĠA ddition
Ġf ind
Ġf av
or ite
Ġexample s
Ġ2 2
Ġc ar
Ġc hirp
Ġm ap
Ġm ak
Ġm erged
Ġm odi
Ġm erging
Ġm ultiplication
Ġm eow
Ġlist s
ue Error
Ġo utput
Ġt uple
Ġt ry
Ġt hr
Ġ1 4
Ġs ound
Ġs wap
di splay
Ġre ad
Ġre peat
Ġre cursive
op er
ul us
Ġy ears
Ġfi lter
Ġb y
Ġb ase
Ġp op
Ġp erson
Re ma
Ġcom bined
ĠC at
ĠC lear
ĠC ount
ĠC alcul
ĠC reate
Ġdi vi
Ġdi splay
ind er
ex ample
Ġmax im
ce car
Ġmin or
wor ld
wor ks
"} }
ra cecar
ye ars
Ġstring s
Ġloop s
Di ff
th on
vi d
ĠF ilter
ĠS et
ĠS wap
ĠS tring
ĠRe ad
ĠRe peat
ĠRe cursive
ou gh
De vel
com bined
gra pe
og ram
let e
par rot
ĠP op
ĠDe lete
Ġcub es
Ġconcaten ated
Ġcalcul ation
Ġdelet e
Ġcount down
Ġindex ing
Cub e
Cub es
In vali
Square s
user name
ĠB as
ĠB ird
ĠL ambda
ĠL oop
ĠM ap
ĠM erging
ĠT uple
ĠT ry
Division Error
Com bined
Pr oduct
ĠG et
Ġz ero
Car ol
Can not
Cur rent
Da vid
Mod ulus
Mana ger
Num ber
Py thon
Qu otient
Sub tra
Tim e
br occ
cher ry
cit y
cub es
dat a
mad am
no on
pine apple
square s
Ġer ror
ĠModi fy
ĠIn sert
ĠVal ueError
ĠZero DivisionError
Ġhand ling
eren ce
Ġemploye e
Ġfav orite
Ġmak es
Ġmodi fy
Ġthr ough
Rema inder
ĠCount down
ĠCalcul ate
Ġdivi de
Ġmaxim um
Diff erence
Devel oper
ogram ming
Invali d
ĠBas ic
Subtra ction
brocc oli
