{"<s>":0,"</s>":1,"!":2,"\"":3,"#":4,"$":5,"%":6,"&":7,"'":8,"(":9,")":10,"*":11,"+":12,",":13,"-":14,".":15,"/":16,"0":17,"1":18,"2":19,"3":20,"4":21,"5":22,"6":23,"7":24,"8":25,"9":26,":":27,";":28,"<":29,"=":30,">":31,"?":32,"@":33,"A":34,"B":35,"C":36,"D":37,"E":38,"F":39,"G":40,"H":41,"I":42,"J":43,"K":44,"L":45,"M":46,"N":47,"O":48,"P":49,"Q":50,"R":51,"S":52,"T":53,"U":54,"V":55,"W":56,"X":57,"Y":58,"Z":59,"[":60,"\\":61,"]":62,"^":63,"_":64,"`":65,"a":66,"b":67,"c":68,"d":69,"e":70,"f":71,"g":72,"h":73,"i":74,"j":75,"k":76,"l":77,"m":78,"n":79,"o":80,"p":81,"q":82,"r":83,"s":84,"t":85,"u":86,"v":87,"w":88,"x":89,"y":90,"z":91,"{":92,"|":93,"}":94,"~":95,"¡":96,"¢":97,"£":98,"¤":99,"¥":100,"¦":101,"§":102,"¨":103,"©":104,"ª":105,"«":106,"¬":107,"®":108,"¯":109,"°":110,"±":111,"²":112,"³":113,"´":114,"µ":115,"¶":116,"·":117,"¸":118,"¹":119,"º":120,"»":121,"¼":122,"½":123,"¾":124,"¿":125,"À":126,"Á":127,"Â":128,"Ã":129,"Ä":130,"Å":131,"Æ":132,"Ç":133,"È":134,"É":135,"Ê":136,"Ë":137,"Ì":138,"Í":139,"Î":140,"Ï":141,"Ð":142,"Ñ":143,"Ò":144,"Ó":145,"Ô":146,"Õ":147,"Ö":148,"×":149,"Ø":150,"Ù":151,"Ú":152,"Û":153,"Ü":154,"Ý":155,"Þ":156,"ß":157,"à":158,"á":159,"â":160,"ã":161,"ä":162,"å":163,"æ":164,"ç":165,"è":166,"é":167,"ê":168,"ë":169,"ì":170,"í":171,"î":172,"ï":173,"ð":174,"ñ":175,"ò":176,"ó":177,"ô":178,"õ":179,"ö":180,"÷":181,"ø":182,"ù":183,"ú":184,"û":185,"ü":186,"ý":187,"þ":188,"ÿ":189,"Ā":190,"ā":191,"Ă":192,"ă":193,"Ą":194,"ą":195,"Ć":196,"ć":197,"Ĉ":198,"ĉ":199,"Ċ":200,"ċ":201,"Č":202,"č":203,"Ď":204,"ď":205,"Đ":206,"đ":207,"Ē":208,"ē":209,"Ĕ":210,"ĕ":211,"Ė":212,"ė":213,"Ę":214,"ę":215,"Ě":216,"ě":217,"Ĝ":218,"ĝ":219,"Ğ":220,"ğ":221,"Ġ":222,"ġ":223,"Ģ":224,"ģ":225,"Ĥ":226,"ĥ":227,"Ħ":228,"ħ":229,"Ĩ":230,"ĩ":231,"Ī":232,"ī":233,"Ĭ":234,"ĭ":235,"Į":236,"į":237,"İ":238,"ı":239,"Ĳ":240,"ĳ":241,"Ĵ":242,"ĵ":243,"Ķ":244,"ķ":245,"ĸ":246,"Ĺ":247,"ĺ":248,"Ļ":249,"ļ":250,"Ľ":251,"ľ":252,"Ŀ":253,"ŀ":254,"Ł":255,"ł":256,"Ń":257,"in":258,"ĠĠ":259,"er":260,"pr":261,"int":262,"print":263,"le":264,"st":265,"Ġ=":266,"Ġ<":267,"Ġ</":268,"Ġ#":269,"am":270,"li":271,"(\"":272,"um":273,"Ġe":274,"\",":275,"list":276,"al":277,"on":278,"ot":279,"ers":280,"en":281,"Ġa":282,":\",":283,"ĠĠĠ":284,"re":285,"num":286,"ple":287,"ĠA":288,"Ġ\"":289,"Ġex":290,"ample":291,"Ġf":292,"ion":293,"numb":294,"ĠAn":295,"or":296,"Ġexample":297,"ge":298,"her":299,"other":300,"ĠAnother":301,"numbers":302,"Ġ2":303,"Ġc":304,"Ġm":305,"at":306,"Ġlist":307,"ed":308,"val":309,"Ġx":310,"Ġin":311,"ct":312,"se":313,"ue":314,"value":315,"Ġo":316,"Ġt":317,"\")":318,"Ġ1":319,"Ġi":320,"Ġs":321,"ar":322,"de":323,"nam":324,"ent":325,"an":326,"it":327,"Ġ[":328,"Ġ{":329,"Ġ3":330,"])":331,"name":332,"ing":333,"Ġ4":334,"di":335,"om":336,"\":":337,"Ġre":338,"lf":339,"my":340,"ment":341,"ction":342,"self":343,"ange":344,"are":345,"qu":346,"range":347,"Ġprint":348,"quare":349,"un":350,"Ġ*":351,"Ġnumbers":352,"ĠĠĠĠ":353,"lement":354,"ĠĠĠĠĠĠĠ":355,"values":356,"):":357,"Ġrange":358,"dd":359,"op":360,"Ġelement":361,"Ġfor":362,"Ġof":363,"ul":364,"Ġ0":365,"Ġ5":366,"es":367,"Ġy":368,"he":369,"Ġfi":370,"lo":371,"ter":372,"ur":373,"Ġb":374,"la":375,"vers":376,"Ġto":377,"ax":378,"Ġis":379,"10":380,"ub":381,"otal":382,"Ġ20":383,"def":384,".\")":385,"Li":386,"age":387,"ven":388,"Ġ+":389,"Ġp":390,"List":391,"pe":392,"ser":393,"sion":394,"Ġn":395,"Ġsum":396,"quared":397,"Ġfile":398,"Re":399,"Ġcom":400,"))":401,"ut":402,"Ġ%":403,"Ġ10":404,"Ġif":405,"dict":406,"unction":407,"el":408,"Ġ6":409,"Ġvalue":410,"Ġmy":411,"[:":412,"eh":413,"tur":414,"ĠC":415,"Ġdi":416,"ind":417,"preh":418,"ension":419,"Ġan":420,"Ġ{\"":421,"Ġ30":422,"Ġretur":423,"ctionar":424,"versed":425,"Ġcompreh":426,"Ġreturn":427,"Ġcomprehension":428,"ck":429,"ex":430,"()":431,"ap":432,"cat":433,"et":434,"for":435,"oun":436,"rom":437,"Ġname":438,"Ġfunction":439,"Ġmax":440,"ult":441,"ce":442,"Ġvalues":443,"Ġ25":444,"squared":445,"Ġ==":446,"Ġmin":447,"ated":448,"[::":449,"Ġdictionar":450,"da":451,"put":452,"([":453,"[\"":454,"__":455,"bda":456,"fter":457,"im":458,"mat":459,"ow":460,"ss":461,"sum":462,"Ġu":463,"Ġself":464,"Ġdef":465,"ambda":466,"Ġafter":467,"Ġop":468,"ith":469,"Ġ40":470,"opp":471,"heck":472,"lass":473,"ubed":474,"fr":475,"uit":476,"Ġnum":477,"get":478,"fruit":479,"fruits":480,"\"]":481,"ak":482,"ir":483,"lambda":484,"ol":485,"odd":486,"ring":487,"wo":488,"wor":489,"Ġeven":490,"alind":491,"oncat":492,"erson":493,"ation":494,"set":495,"Ġodd":496,"Ġsquare":497,"Ġ50":498,"rome":499,"[::-":500,"Ġdictionary":501,"alindrome":502,"oncaten":503,"15":504,"ble":505,"is":506,"ve":507,"Ġ8":508,"Ġtotal":509,"Ġ15":510,"\"}":511,")]":512,"ix":513,"ies":514,"ra":515,"rix":516,"uple":517,"with":518,"ye":519,"Ġ-":520,"Ġj":521,"Ġst":522,"Ġlo":523,"ĠList":524,"lear":525,"Ġcheck":526,"ate":527,"del":528,"ition":529,"ess":530,"peated":531,"sert":532,"opped":533,"ake":534,"Ġstring":535,"Ġloop":536,"est":537,"od":538,"total":539,"ite":540,"ext":541,"Di":542,"ad":543,"act":544,"cc":545,"even":546,"ip":547,"ial":548,"mp":549,"ry":550,"th":551,"vi":552,"Ġ>":553,"ĠF":554,"ĠS":555,"ĠRe":556,"Ġget":557,"erge":558,"number":559,"orial":560,"Ġ**":561,"loye":562,"last":563,"verse":564,"Ġand":565,"ultip":566,"olor":567,"word":568,"actorial":569,"mploye":570,"erged":571,"able":572,"gre":573,"ou":574,"rite":575,"Ġv":576,"Ġle":577,"Ġ35":578,"ull":579,"ount":580,"ables":581,"!=":582,"**":583,"={":584,"De":585,"The":586,"][":587,"cing":588,"com":589,"cul":590,"class":591,"cubed":592,"cies":593,"employe":594,"fi":595,"gra":596,"gth":597,"if":598,"lse":599,"lter":600,"mo":601,"of":602,"og":603,"odi":604,"pt":605,"person":606,"sing":607,"sult":608,"tx":609,"tent":610,"two":611,"tuple":612,"}.":613,"Ġ__":614,"Ġ!=":615,"init":616,"eration":617,"let":618,"licing":619,"Ġelse":620,"alcul":621,"ontent":622,"Ġas":623,"Ġage":624,"Ġfactorial":625,"Ġclass":626,"Ġinput":627,"Ġthe":628,"\"))":629,"Ġ12":630,"Ġslicing":631,"Ġ{}.":632,"Ġelements":633,"Ġ+=":634,"Ġpow":635,"Ġpalindrome":636,"pecies":637,"Reversed":638,"else":639,"exce":640,"__(":641,"imer":642,"matrix":643,"Ġuser":644,"Ġusing":645,"Ġopen":646,"Ġoperation":647,"irst":648,"ested":649,"ccess":650,"greet":651,"Ġlen":652,"txt":653,"Ġpower":654,"except":655,"12":656,"20":657,"Ali":658,"Max":659,"car":660,"ly":661,"write":662,"ine":663,"reversed":664,"Ġ18":665,"Ġ45":666,"Ġreversed":667,"utput":668,"Alice":669,"\"])":670,"Bo":671,"Hel":672,"Min":673,"Modi":674,"Total":675,"You":676,"ase":677,"bin":678,"dog":679,"hi":680,"ic":681,"ld":682,"make":683,"multip":684,"merged":685,"os":686,"par":687,"palindrome":688,"pos":689,"rst":690,"ror":691,"text":692,"whi":693,"Ġ/":694,"Ġ9":695,"ĠP":696,"Ġde":697,"Ġlambda":698,"Ġlast":699,"ĠDe":700,"Ġare":701,"ĠAccess":702,"Ġexp":703,"Ġfrom":704,"Ġcub":705,"Ġconcaten":706,"Ġclear":707,"Ġcolor":708,"Ġcalcul":709,"Ġmake":710,"Ġinsert":711,"Ġtwo":712,"Ġtimer":713,"Ġsquared":714,"ana":715,"Ġresult":716,"ddition":717,"Ġfirst":718,"Ġnested":719,"ound":720,"\"],":721,"\"},":722,"grade":723,"Ġoperations":724,"Bob":725,"Hello":726,"bined":727,"multiply":728,"position":729,"while":730,"Ġdelet":731,"!\")":732,"En":733,"Jo":734,"Wel":735,"hn":736,"our":737,"sp":738,"Ġcount":739,"Ġinde":740,"Ġtext":741,"Ġreverse":742,"ounter":743,"own":744,"getables":745,"vegetables":746,"Ġvot":747,"come":748,"John":749,"Welcome":750,"Ġindex":751,")}":752,":])":753,"?\",":754,"Cub":755,"Cubed":756,"Er":757,"Even":758,"First":759,"In":760,"Is":761,"La":762,"Len":763,"Popped":764,"Sum":765,"Square":766,"][::-":767,"add":768,"ban":769,"base":770,"cur":771,"clear":772,"color":773,"content":774,"dent":775,"down":776,"element":777,"fy":778,"first":779,"fine":780,"gi":781,"ging":782,"hod":783,"ive":784,"iables":785,"ma":786,"min":787,"max":788,"map":789,"met":790,"mess":791,"odel":792,"output":793,"pen":794,"pop":795,"popped":796,"rith":797,"species":798,"sound":799,"sive":800,"ting":801,"tment":802,"try":803,"uct":804,"user":805,"udent":806,"vel":807,"wap":808,"},":809,"}\")":810,"Ġ'":811,"Ġ(":812,"Ġ7":813,"ĠB":814,"ĠL":815,"ĠM":816,"ĠT":817,"Ġor":818,"Ġnam":819,"Ġwith":820,"ĠDi":821,"Ġnumber":822,"Ġword":823,"insert":824,"ero":825,"erging":826,"student":827,"licat":828,"ligi":829,"Ġarith":830,"repeated":831,"read":832,"remo":833,"Ġ\")":834,"ĠAnim":835,"Ġcubed":836,"Ġcontent":837,"Ġmat":838,"Ġmet":839,"Ġmodel":840,"Ġold":841,"Ġspecies":842,"ars":843,"ariables":844,"depar":845,"Ġ[\"":846,"Ġ[[":847,"Ġ{**":848,"]))":849,"Ġrepeated":850,"Ġformat":851,"Ġyour":852,"lock":853,"Ġblock":854,"lay":855,"Ġpopp":856,"Ġpopped":857,"peat":858,"Repeated":859,"ĠCar":860,"ĠCheck":861,"ĠConcaten":862,"ctionary":863,"apple":864,"appen":865,"format":866,"Ġdictionaries":867,"\"][\"":868,"Ġsquares":869,"oncatenated":870,"Ġ-=":871,"oduct":872,"Divi":873,"Ġ>=":874,"ĠFunction":875,"ĠFind":876,"ĠSum":877,"ĠReverse":878,"ultiplicat":879,"Ġvariables":880,"][-":881,"employee":882,"employees":883,"fied":884,"filter":885,"model":886,"Ġ{}.\"":887,"Ġusername":888,"greeting":889,"Ġlength":890,"Modified":891,"ĠPerson":892,"ĠDefine":893,"Ġcube":894,"Ġconcatenation":895,"Ġclearing":896,"Ġcalculate":897,"Ġinsertion":898,"Ġdeletion":899,"Enter":900,"splay":901,"Ġvote":902,"Error":903,"Last":904,"Length":905,"banana":906,"cursive":907,"metic":908,"message":909,"Ġnamed":910,"ĠDictionary":911,"students":912,"ligible":913,"Ġarithmetic":914,"remove":915,"ĠAnimal":916,"Ġmatrix":917,"Ġmethod":918,"department":919,"Ġformatting":920,"Ġpopping":921,"ĠConcatenate":922,"append":923,"Division":924,"ultiplication":925,",\",":926,"Com":927,"Full":928,"Pr":929,"as":930,"eow":931,"full":932,"ger":933,"hir":934,"his":935,"rot":936,"te":937,"ĠG":938,"Ġz":939,"Ġint":940,"Ġwrite":941,"ĠWelcome":942,"Ġeligible":943,"plete":944,"Ġfull":945,"Ġ24":946,"Ġ28":947,"Ġcounter":948,"and":949,"ird":950,"hirp":951,"Addition":952,"Car":953,"Can":954,"Cur":955,"Concatenated":956,"Da":957,"Factorial":958,"Mod":959,"Merged":960,"Mana":961,"Multiplication":962,"Num":963,"Nested":964,"Odd":965,"Py":966,"Qu":967,"Sub":968,"Squared":969,"Tim":970,"This":971,"User":972,"Val":973,"Write":974,"Zero":975,"av":976,"ali":977,"br":978,"ber":979,"cher":980,"cit":981,"cub":982,"concatenated":983,"dat":984,"dult":985,"ears":986,"ff":987,"gh":988,"hr":989,"hand":990,"ient":991,"ilter":992,"ks":993,"ling":994,"ming":995,"mad":996,"no":997,"not":998,"oli":999,"oop":1000,"occ":1001,"pine":1002,"ram":1003,"rent":1004,"son":1005,"sample":1006,"square":1007,"tring":1008,"tra":1009,"test":1010,"timer":1011,"us":1012,"vali":1013,"}.\")":1014,"ĠI":1015,"Ġer":1016,"Ġam":1017,"Ġset":1018,"Ġgreet":1019,"ĠModi":1020,"Ġwhile":1021,"ĠEven":1022,"ĠIn":1023,"ĠNested":1024,"ĠUser":1025,"ĠVal":1026,"ĠWrite":1027,"ĠZero":1028,"Ġhand":1029,"input":1030,"eren":1031,"product":1032,"level":1033,"Ġemploye":1034,"otient":1035,"Ġaccess":1036,"Ġaddition":1037,"Ġadult":1038,"reate":1039,"result":1040,"ĠAge":1041,"ĠAddition":1042,"Ġfind":1043,"Ġfav":1044,"orite":1045,"Ġexamples":1046,"Ġ22":1047,"Ġcar":1048,"Ġchirp":1049,"Ġmap":1050,"Ġmak":1051,"Ġmerged":1052,"Ġmodi":1053,"Ġmerging":1054,"Ġmultiplication":1055,"Ġmeow":1056,"Ġlists":1057,"ueError":1058,"Ġoutput":1059,"Ġtuple":1060,"Ġtry":1061,"Ġthr":1062,"Ġ14":1063,"Ġsound":1064,"Ġswap":1065,"display":1066,"Ġread":1067,"Ġrepeat":1068,"Ġrecursive":1069,"oper":1070,"ulus":1071,"Ġyears":1072,"Ġfilter":1073,"Ġby":1074,"Ġbase":1075,"Ġpop":1076,"Ġperson":1077,"Rema":1078,"Ġcombined":1079,"ĠCat":1080,"ĠClear":1081,"ĠCount":1082,"ĠCalcul":1083,"ĠCreate":1084,"Ġdivi":1085,"Ġdisplay":1086,"inder":1087,"example":1088,"Ġmaxim":1089,"cecar":1090,"Ġminor":1091,"world":1092,"works":1093,"\"}}":1094,"racecar":1095,"years":1096,"Ġstrings":1097,"Ġloops":1098,"Diff":1099,"thon":1100,"vid":1101,"ĠFilter":1102,"ĠSet":1103,"ĠSwap":1104,"ĠString":1105,"ĠRead":1106,"ĠRepeat":1107,"ĠRecursive":1108,"ough":1109,"Devel":1110,"combined":1111,"grape":1112,"ogram":1113,"lete":1114,"parrot":1115,"ĠPop":1116,"ĠDelete":1117,"Ġcubes":1118,"Ġconcatenated":1119,"Ġcalculation":1120,"Ġdelete":1121,"Ġcountdown":1122,"Ġindexing":1123,"Cube":1124,"Cubes":1125,"Invali":1126,"Squares":1127,"username":1128,"ĠBas":1129,"ĠBird":1130,"ĠLambda":1131,"ĠLoop":1132,"ĠMap":1133,"ĠMerging":1134,"ĠTuple":1135,"ĠTry":1136,"DivisionError":1137,"Combined":1138,"Product":1139,"ĠGet":1140,"Ġzero":1141,"Carol":1142,"Cannot":1143,"Current":1144,"David":1145,"Modulus":1146,"Manager":1147,"Number":1148,"Python":1149,"Quotient":1150,"Subtra":1151,"Time":1152,"brocc":1153,"cherry":1154,"city":1155,"cubes":1156,"data":1157,"madam":1158,"noon":1159,"pineapple":1160,"squares":1161,"Ġerror":1162,"ĠModify":1163,"ĠInsert":1164,"ĠValueError":1165,"ĠZeroDivisionError":1166,"Ġhandling":1167,"erence":1168,"Ġemployee":1169,"Ġfavorite":1170,"Ġmakes":1171,"Ġmodify":1172,"Ġthrough":1173,"Remainder":1174,"ĠCountdown":1175,"ĠCalculate":1176,"Ġdivide":1177,"Ġmaximum":1178,"Difference":1179,"Developer":1180,"ogramming":1181,"Invalid":1182,"ĠBasic":1183,"Subtraction":1184,"broccoli":1185}